
P A U P *
Version 4.0a (build 163) for Unix/Linux (built on Jul 23 2018 at 19:49:27)
Sun Sep 16 13:17:11 2018


paup> execute bears_JC69.nex

Processing of file "~/repos/macrophy_course/projects/PAUP_lab/bears_JC69.nex" begins...

Data read in DNA format

Data matrix has 10 taxa, 300 characters
Valid character-state symbols: ACGT
Missing data identified by '?'
Gaps identified by '-'
"Equate" macros in effect:
   R,r ==> {AG}
   Y,y ==> {CT}
   M,m ==> {AC}
   K,k ==> {GT}
   S,s ==> {CG}
   W,w ==> {AT}
   H,h ==> {ACT}
   B,b ==> {CGT}
   V,v ==> {ACG}
   D,d ==> {AGT}
   N,n ==> {ACGT}

Processing of input file "bears_JC69.nex" completed.

paup> outgroup Canis_lupus

Outgroup status changed:
  1 taxon transferred to outgroup
  Total number of taxa now in outgroup = 1
  Number of ingroup taxa = 9

paup> set criterion=parsimony

paup> alltrees

Exhaustive search settings:
  Optimality criterion = parsimony
    Character-status summary:
      Of 300 total characters:
        All characters are of type 'unord'
        All characters have equal weight
        31 characters are constant (proportion = 0.103333)
        138 variable characters are parsimony-uninformative
        Number of parsimony-informative characters = 131
    Gaps are treated as "missing"
  Initial 'Maxtrees' setting = 100
  Branches collapsed (creating polytomies) if maximum branch length is zero
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

Exhaustive search completed:
  Number of trees evaluated = 2027025
  Score of best tree found = 491
  Score of worst tree found = 617
  Number of trees retained = 2
  Time used = 0.68 sec (CPU time = 0.68 sec)

Frequency distribution of tree scores:

         mean=592.389100 sd=17.091058 g1=-1.167594 g2=1.048914
491.000 /--------------------------------------------------------------------------------------------------------
497.300 | (19)
503.600 | (58)
509.900 | (128)
516.200 | (511)
522.500 | (1725)
528.800 |# (2391)
535.100 |# (6537)
541.400 |### (12973)
547.700 |#### (18293)
554.000 |#### (20187)
560.300 |########## (46559)
566.600 |###################### (103700)
572.900 |############### (72302)
579.200 |############################# (136526)
585.500 |################################## (161859)
591.800 |####################################### (187145)
598.100 |########################################################### (281232)
604.400 |############################################################################ (363228)
610.700 |######################################################################################################## (494835)
617.000 |######################### (116817)
        \--------------------------------------------------------------------------------------------------------

paup> showtrees

Tree 1 (rooted using user-specified outgroup)

/-------------------------------------------------------------------------------------------------- Canis lupus
|
|           /-------------------------------------------------------------------------------------- Phoca largha
|           |
|           |            /------------------------------------------------------------------------- Ailuropoda melanoleuca
\-----------+            |
            |            |           /------------------------------------------------------------- Tremarctos ornatus
            \------------+           |
                         |           |                                    /------------------------ Helarctos malayanus
                         |           |                                    |
                         |           |                       /------------+           /------------ Ursus americanus
                         \-----------+                       |            \-----------+
                                     |           /-----------+                        \------------ Ursus thibetanus
                                     |           |           |
                                     |           |           |                        /------------ Ursus arctos
                                     \-----------+           \------------------------+
                                                 |                                    \------------ Ursus maritimus
                                                 |
                                                 \------------------------------------------------- Melursus ursinus

paup> showtree 2

Tree 2 (rooted using user-specified outgroup)

/-------------------------------------------------------------------------------------------------- Canis lupus
|
|             /------------------------------------------------------------------------------------ Phoca largha
|             |
\-------------+             /---------------------------------------------------------------------- Ailuropoda melanoleuca
              |             |
              |             |             /-------------------------------------------------------- Tremarctos ornatus
              \-------------+             |
                            |             |                           /---------------------------- Helarctos malayanus
                            |             |                           |
                            \-------------+             /-------------+             /-------------- Ursus americanus
                                          |             |             \-------------+
                                          |             |                           \-------------- Ursus thibetanus
                                          \-------------+
                                                        |                           /-------------- Ursus arctos
                                                        |             /-------------+
                                                        |             |             \-------------- Ursus maritimus
                                                        \-------------+
                                                                      \---------------------------- Melursus ursinus

paup> bandb

Branch-and-bound search settings:
  Optimality criterion = parsimony
    Character-status summary:
      Of 300 total characters:
        All characters are of type 'unord'
        All characters have equal weight
        31 characters are constant (proportion = 0.103333)
        138 variable characters are parsimony-uninformative
        Number of parsimony-informative characters = 131
    Gaps are treated as "missing"
  Initial upper bound: unknown (compute heuristically)
  Addition sequence: furthest
  Initial 'Maxtrees' setting = 100
  Branches collapsed (creating polytomies) if maximum branch length is zero
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

Branch-and-bound search completed:
  Score of best tree found = 491
  Number of trees retained = 2
  Time used = 0.00 sec (CPU time = 0.00 sec)

paup> savetrees file=./seank6/descriptive-file-name.tre format=newick root=yes brlens=yes supportvalues=nod

OK to replace file "descriptive-file-name.tre"? (Y/n)y

2 trees saved to file "~/repos/macrophy_course/projects/PAUP_lab/seank6/descriptive-file-name.tre" in raw Newick format

paup> set criterion=likelihood

Optimality criterion set to likelihood.

paup> l set ?

Error(#145): Ambiguous command abbreviation: l (Link Leave)

paup> lset ?

Usage: LSet [model=<model-name>] [fixAllParams | estAllParams] [options...];

Available options:

Keyword ------- Option type -------------------------------------- Current setting -----------------
NST             1|2|6                                              2
tratio          <real-value>|estimate|previous                     2
rmatrix         (<rAC><rAG><rAT><rCG><rCT>)|estimate|previous      (1 1 1 1 1)
rclass          (<cAC><cAG><cAT><cCG><cCT><cGT>)                   '(abcdef)'
variant         HKY|F84                                            HKY
baseFreq        empirical|equal|estimate|previous|
                (<frqA><frqC><frqG>)                               empirical
rates           equal|gamma|siteSpec                               equal
shape           <real-value>|estimate|previous                     0.5
ncat            <integer-value>                                    4
repRate         mean|median                                        mean
pinvar          <real-value>|estimate|previous                     0
siteRates       partition[:<charpartition-name>]|
                rateset[:<rateset-name>]|previous                  (none)
mpartition      <modelpartition-name>                              (none)
modelRates      estimate|previous|equal                            (none)
initBrLen       rogers|acctranRog|LS|<real-value>                  Rogers
scoreDigits     <integer-value>|auto                               auto
lCollapse       no|yes                                             yes
maxPass         <integer-value>                                    20
spToler         <real-value>                                       1e-07
dpToler         <real-value>                                       1e-10
approxLim       <real-value>|none                                  5
adjustAppLim    no|yes                                             yes
logIter         no|yes                                             no
zeroLenTest     no|full|crude                                      no
recon           marginal|joint                                     marginal
allProbs        no|yes                                             no
clock           no|yes                                             no
userBrLens      no|yes                                             no
startVals       parsApprox|arbitrary                               parsApprox
paramClock      Thorne|relAge|Rambaut                              Thorne
mlDistforLS     no|yes                                             no
showQMatrix     no|yes                                             no
fastStep        no|yes                                             yes
optimizer       Praxis|LBFGS                                       Praxis
blopt           newton1D|brent1D|multiDim                          newton1D
clRescale       <real-value>                                       1e-20
gRateScale      <real-value>|estimate|previous                     1
condVar         no|yes|auto                                        auto
precision       double|single                                      single
vectorize       no|yes                                             yes
nthreads        <integer-value>|auto                               1

Options for amino-acid models:

Keyword ------- Option type -------------------------------------- Current setting -----------------
aaFreq          empirical|equal|estimate|previous|(<list>)|
                Intrinsic                                          empirical
aaRMatrix       (<rAC>...<rYV>)|estimate|previous|oneST|JTT|
                JTTPAML|PAM|MTrev24|WAG|WAGstar|LG                 JTT

Options for generic k-state models ("standard" data):

Keyword ------- Option type -------------------------------------- Current setting -----------------
mkStateSpace    variable|fixed                                     variable
genFreq         empirical|equal|estimate|previous|(<list>)         empirical
genRmatrix      (<r01><r02>...)|estimate|previous|oneST            OneST
genRclass       (<c01><c02>...)                                    '(aaaaaa)'

The following options pertain only to Beagle-enabled versions::

Keyword ------- Option type -------------------------------------- Current setting -----------------
useBeagle       no|GPU|CPU|<resource-number>                       no
invarSiteMem    compact|fullStore                                  compact

paup> lset nst=1 basefreq=equal

paup> hsearch

Heuristic search settings:
  Optimality criterion = likelihood
    300 characters are included
    All characters have equal weight
    Likelihood settings:
      Current model:
                               Data type = nucleotide
                      Substitution types = 1
                       State frequencies = equal
          Proportion of invariable sites = none
                 Rates at variable sites = equal
                    Model correspondence = JC69

      Number of distinct data patterns under this model = 220
      Molecular clock not enforced
      Starting branch lengths obtained using Rogers-Swofford approximation method
      Trees with approximate log likelihoods 5% or further from the target score are rejected without additional iteration
      Branch-length optimization = one-dimensional Newton-Raphson with pass limit=20, tolerance=1e-07
      Likelihood calculations performed in single precision
      Vector processing enabled
      Conditional-likelihood rescaling threshold = 1e-20
      Using 1 thread on 22 physical (88 logical) processors

  Starting tree(s) obtained via stepwise addition
    Addition sequence: as-is
    Number of trees held at each step = 1
  Branch-swapping algorithm: tree-bisection-reconnection (TBR) with reconnection limit = 8
    Steepest descent option not in effect
  Initial 'Maxtrees' setting = 100
  Branches collapsed (creating polytomies) if branch length is less than or equal to 1e-08
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

Heuristic search completed
  Total number of rearrangements tried = 300
  Score of best tree(s) found = 2185.041
  Number of trees retained = 1
  Time used = 0.16 sec (CPU time = 0.16 sec)

paup> describetrees /plot=phylogram

Tree description:

  Unrooted tree(s) rooted using outgroup method
  Optimality criterion = likelihood
    300 characters are included
    All characters have equal weight
    Likelihood settings:
      Current model:
                               Data type = nucleotide
                      Substitution types = 1
                       State frequencies = equal
          Proportion of invariable sites = none
                 Rates at variable sites = equal
                    Model correspondence = JC69

      Number of distinct data patterns under this model = 220
      Molecular clock not enforced
      Starting branch lengths obtained using Rogers-Swofford approximation method
      Branch-length optimization = one-dimensional Newton-Raphson with pass limit=20, tolerance=1e-07
      Likelihood calculations performed in single precision
      Vector processing enabled
      Conditional-likelihood rescaling threshold = 1e-20
      Using 1 thread on 22 physical (88 logical) processors

Tree 1 (rooted using user-specified outgroup)

-Ln likelihood = 2185.041

/-------------------------------------------------------------------------------------------------- Canis lupus
|
|                /----------------------------------------- Phoca largha
|                |
|                |                                                 /------------------------------- Ailuropoda melanoleuca
|                |                                                 |
|                |                                                 |            /---------- Helarctos malayanus
|                |                                                 |            |
\---------------18                                                 |          /12  /------- Ursus americanus
                 |                                           /----16          | \-11
                 |                                           |     |         14    \------ Ursus thibetanus
                 |                                           |     |         ||
                 |                                           |     |         ||      /-- Ursus arctos
                 \------------------------------------------17     \--------15\-----13
                                                             |               |       \-- Ursus maritimus
                                                             |               |
                                                             |               \----- Melursus ursinus
                                                             |
                                                             \----------------- Tremarctos ornatus

paup> lset nst=2 basefreq=equal

paup> hsearch

Heuristic search settings:
  Optimality criterion = likelihood
    300 characters are included
    All characters have equal weight
    Likelihood settings:
      Current model:
                               Data type = nucleotide
                      Substitution types = 2
                             Ti/tv ratio = 2
                       State frequencies = equal
          Proportion of invariable sites = none
                 Rates at variable sites = equal
                    Model correspondence = K80 (=K2P)

      Number of distinct data patterns under this model = 220
      Molecular clock not enforced
      Starting branch lengths obtained using Rogers-Swofford approximation method
      Trees with approximate log likelihoods 5% or further from the target score are rejected without additional iteration
      Branch-length optimization = one-dimensional Newton-Raphson with pass limit=20, tolerance=1e-07
      Likelihood calculations performed in single precision
      Vector processing enabled
      Conditional-likelihood rescaling threshold = 1e-20
      Using 1 thread on 22 physical (88 logical) processors

  Starting tree(s) obtained via stepwise addition
    Addition sequence: as-is
    Number of trees held at each step = 1
  Branch-swapping algorithm: tree-bisection-reconnection (TBR) with reconnection limit = 8
    Steepest descent option not in effect
  Initial 'Maxtrees' setting = 100
  Branches collapsed (creating polytomies) if branch length is less than or equal to 1e-08
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

Heuristic search completed
  Total number of rearrangements tried = 274
  Score of best tree(s) found = 2232.299
  Number of trees retained = 1
  Time used = 0.17 sec (CPU time = 0.17 sec)

paup> describetrees /plot=phylogram

Tree description:

  Unrooted tree(s) rooted using outgroup method
  Optimality criterion = likelihood
    300 characters are included
    All characters have equal weight
    Likelihood settings:
      Current model:
                               Data type = nucleotide
                      Substitution types = 2
                             Ti/tv ratio = 2
                       State frequencies = equal
          Proportion of invariable sites = none
                 Rates at variable sites = equal
                    Model correspondence = K80 (=K2P)

      Number of distinct data patterns under this model = 220
      Molecular clock not enforced
      Starting branch lengths obtained using Rogers-Swofford approximation method
      Branch-length optimization = one-dimensional Newton-Raphson with pass limit=20, tolerance=1e-07
      Likelihood calculations performed in single precision
      Vector processing enabled
      Conditional-likelihood rescaling threshold = 1e-20
      Using 1 thread on 22 physical (88 logical) processors

Tree 1 (rooted using user-specified outgroup)

-Ln likelihood = 2232.299

/-------------------------------------------------------------------------------------------------- Canis lupus
|
|                        /-------------------------------------------- Phoca largha
|                        |
|                        |                                              /-------------------------- Ailuropoda melanoleuca
|                        |                                              |
|                        |                                              |        /--------- Helarctos malayanus
\-----------------------18                                              |        |
                         |                                        /----16       12  /------ Ursus americanus
                         |                                        |     |       |\-11
                         |                                        |     |       |   \----- Ursus thibetanus
                         |                                        |     \------15
                         |                                        |             |     /- Ursus arctos
                         \---------------------------------------17             +----13
                                                                  |             |     \-- Ursus maritimus
                                                                  |            14
                                                                  |             \----- Melursus ursinus
                                                                  |
                                                                  \------------- Tremarctos ornatus

paup> execute bears_LBAtree.nex

Processing of file "~/repos/macrophy_course/projects/PAUP_lab/bears_LBAtree.nex" begins...

Are you sure you want to reset the active datafile? (Y/n)Y

1 tree read from TREES block; time used = 0.00 sec (CPU time = 0.00 sec)

Processing of input file "bears_LBAtree.nex" completed.

paup> describetrees /plot=phylogram

Tree description:

Tree 1 ("UNTITLED"):

/---------------------------------- Canis lupus
|
19        /------------------------- Phoca largha
|         |
|         |            /------------------------------------------------------------------------- Ailuropoda melanoleuca
\--------18            |
          |            |   /--------- Tremarctos ornatus
          \-----------17   |
                       |   |      /---------------------------------------------------------------- Helarctos malayanus
                       |   |      |
                       |   |     12/--- Ursus americanus
                       \--16     |11
                           |    14 \--- Ursus thibetanus
                           |    ||
                           |    ||  /-- Ursus arctos
                           \---15\-13
                                |   \-- Ursus maritimus
                                |
                                \---- Melursus ursinus

paup> execute bears_LBA500.nex

Processing of file "~/repos/macrophy_course/projects/PAUP_lab/bears_LBA500.nex" begins...

Are you sure you want to reset the active datafile? (Y/n)Y

Data read in DNA format

Data matrix has 10 taxa, 500 characters
Valid character-state symbols: ACGT
Missing data identified by '?'
Gaps identified by '-'
"Equate" macros in effect:
   R,r ==> {AG}
   Y,y ==> {CT}
   M,m ==> {AC}
   K,k ==> {GT}
   S,s ==> {CG}
   W,w ==> {AT}
   H,h ==> {ACT}
   B,b ==> {CGT}
   V,v ==> {ACG}
   D,d ==> {AGT}
   N,n ==> {ACGT}

Processing of input file "bears_LBA500.nex" completed.

paup> bootstrap nreps=100

Bootstrap method with heuristic search:
  Number of bootstrap replicates = 100
  Starting seed = generated automatically
  Number of characters resampled in each replicate = 500
  Optimality criterion = likelihood
    500 characters are included
    All characters have equal weight
    Likelihood settings:
      Current model:
                               Data type = nucleotide
                      Substitution types = 2
                             Ti/tv ratio = 2
                       State frequencies = equal
          Proportion of invariable sites = none
                 Rates at variable sites = equal
                    Model correspondence = K80 (=K2P)

      Number of distinct data patterns under this model = 435
      Molecular clock not enforced
      Starting branch lengths obtained using Rogers-Swofford approximation method
      Trees with approximate log likelihoods 5% or further from the target score are rejected without additional iteration
      Branch-length optimization = one-dimensional Newton-Raphson with pass limit=20, tolerance=1e-07
      Likelihood calculations performed in single precision
      Vector processing enabled
      Conditional-likelihood rescaling threshold = 1e-20
      Using 1 thread on 22 physical (88 logical) processors

  Starting tree(s) obtained via stepwise addition
    Addition sequence: as-is
    Number of trees held at each step = 1
  Branch-swapping algorithm: tree-bisection-reconnection (TBR) with reconnection limit = 8
    Steepest descent option not in effect
  Initial 'Maxtrees' setting = 100
  Branches collapsed (creating polytomies) if branch length is less than or equal to 1e-08
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

  100 bootstrap replicates completed
  Time used = 36.66 sec (CPU time = 36.67 sec)

Bootstrap 50% majority-rule consensus tree

/---------------------------------------------------------------------------------------------- Canis lupus(1)
|
|                  /--------------------------------------------------------------------------- Phoca largha(2)
|                  |
|                  |                                    /-------------------------------------- Ailuropoda melanoleuca(3)
|                  |                                    |
|                  |                                    +-------------------------------------- Helarctos malayanus(5)
|                  |                                    |
\------------------+                                    |                  /------------------- Ursus americanus(6)
                   |                                    +--------55--------+
                   |                  /-------58--------+                  \------------------- Ursus thibetanus(7)
                   |                  |                 |
                   |                  |                 |                  /------------------- Ursus arctos(8)
                   |                  |                 +--------59--------+
                   \--------95--------+                 |                  \------------------- Ursus maritimus(9)
                                      |                 |
                                      |                 \-------------------------------------- Melursus ursinus(10)
                                      |
                                      \-------------------------------------------------------- Tremarctos ornatus(4)

Bipartitions found in one or more trees and frequency of occurrence (bootstrap support values):

         1
1234567890          Freq
------------------------
..********         95.00
.......**.         59.00
..*.******         58.00
.....**...         55.33
....***...         49.67
....******         42.00
....*****.         40.00
..*.*****.         37.00
...*******         27.00
..*.*.....         27.00
....**....         25.00
..*....**.         24.00
..*.....*.         21.00
....*.*...         15.00
.....****.         14.33
..*.*..**.         13.33
..**......         13.00
..*.*...*.          9.00
....*..**.          8.33
.....*****          7.33
..*.***...          6.00
..*..****.          5.33
....*...*.          5.00
..*......*          5.00
..*..*****          5.00
....*....*          5.00

13 groups at (relative) frequency less than 5% not shown

paup> bootstrap nreps=100 search=heuristic/swap=NNI nreps=1

Bootstrap method with heuristic search:
  Number of bootstrap replicates = 100
  Starting seed = generated automatically
  Number of characters resampled in each replicate = 500
  Optimality criterion = likelihood
    500 characters are included
    All characters have equal weight
    Likelihood settings:
      Current model:
                               Data type = nucleotide
                      Substitution types = 2
                             Ti/tv ratio = 2
                       State frequencies = equal
          Proportion of invariable sites = none
                 Rates at variable sites = equal
                    Model correspondence = K80 (=K2P)

      Number of distinct data patterns under this model = 435
      Molecular clock not enforced
      Starting branch lengths obtained using Rogers-Swofford approximation method
      Trees with approximate log likelihoods 5% or further from the target score are rejected without additional iteration
      Branch-length optimization = one-dimensional Newton-Raphson with pass limit=20, tolerance=1e-07
      Likelihood calculations performed in single precision
      Vector processing enabled
      Conditional-likelihood rescaling threshold = 1e-20
      Using 1 thread on 22 physical (88 logical) processors

  Starting tree(s) obtained via stepwise addition
    Addition sequence: as-is
    Number of trees held at each step = 1
  Branch-swapping algorithm: nearest-neighbor interchange (NNI)
    Steepest descent option not in effect
  Initial 'Maxtrees' setting = 100
  Branches collapsed (creating polytomies) if branch length is less than or equal to 1e-08
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

  100 bootstrap replicates completed
  Time used = 5.54 sec (CPU time = 5.54 sec)

Bootstrap 50% majority-rule consensus tree

/---------------------------------------------------------------------------------------------- Canis lupus(1)
|
|                  /--------------------------------------------------------------------------- Phoca largha(2)
|                  |
|                  |                  /-------------------------------------------------------- Ailuropoda melanoleuca(3)
\------------------+                  |
                   |                  +-------------------------------------------------------- Tremarctos ornatus(4)
                   |                  |
                   |                  |                 /-------------------------------------- Helarctos malayanus(5)
                   \--------88--------+                 |
                                      |                 |                  /------------------- Ursus americanus(6)
                                      |                 +--------63--------+
                                      |                 |                  \------------------- Ursus thibetanus(7)
                                      \-------52--------+
                                                        |                  /------------------- Ursus arctos(8)
                                                        +--------92--------+
                                                        |                  \------------------- Ursus maritimus(9)
                                                        |
                                                        \-------------------------------------- Melursus ursinus(10)

Bipartitions found in one or more trees and frequency of occurrence (bootstrap support values):

         1
1234567890          Freq
------------------------
.......**.         92.50
..********         88.00
.....**...         63.33
....******         51.50
....*****.         45.00
.....****.         39.67
....***...         38.67
..*.******         38.50
...*******         38.33
..*.*.....         35.33
.....*****         26.00
..*.*****.         16.00
....**....         15.33
....*.*...         14.33
...*.*****         13.00
.*.*******         10.00
..*.***...         10.00
..**......          9.50
..*......*          7.00
....*..**.          6.67
..*.**....          6.00
..*.*....*          6.00
....*....*          6.00
..*.*..**.          5.00

12 groups at (relative) frequency less than 5% not shown

paup> execute bears_irbp.nex

Processing of file "~/repos/macrophy_course/projects/PAUP_lab/bears_irbp.nex" begins...

Are you sure you want to reset the active datafile? (Y/n)Y

Data read in DNA format

Data matrix has 10 taxa, 1281 characters
Valid character-state symbols: ACGT
Missing data identified by '?'
Gaps identified by '-'
"Equate" macros in effect:
   R,r ==> {AG}
   Y,y ==> {CT}
   M,m ==> {AC}
   K,k ==> {GT}
   S,s ==> {CG}
   W,w ==> {AT}
   H,h ==> {ACT}
   B,b ==> {CGT}
   V,v ==> {ACG}
   D,d ==> {AGT}
   N,n ==> {ACGT}

Processing of input file "bears_irbp.nex" completed.

paup> execute modelblockPAUPb10.nex

Processing of file "~/repos/macrophy_course/projects/PAUP_lab/modelblockPAUPb10.nex" begins...

 ***** MODELFIT BLOCK -- MODELTEST 3.4 *****
