
P A U P *
Version 4.0a (build 163) for Unix/Linux (built on Jul 23 2018 at 19:49:27)
Wed Sep 19 13:52:36 2018


paup> lset ?

Usage: LSet [model=<model-name>] [fixAllParams | estAllParams] [options...];

Available options:

Keyword ------- Option type -------------------------------------- Current setting -----------------
NST             1|2|6                                              2
tratio          <real-value>|estimate|previous                     2
rmatrix         (<rAC><rAG><rAT><rCG><rCT>)|estimate|previous      (1 1 1 1 1)
rclass          (<cAC><cAG><cAT><cCG><cCT><cGT>)                   '(abcdef)'
variant         HKY|F84                                            HKY
baseFreq        empirical|equal|estimate|previous|
                (<frqA><frqC><frqG>)                               empirical
rates           equal|gamma|siteSpec                               equal
shape           <real-value>|estimate|previous                     0.5
ncat            <integer-value>                                    4
repRate         mean|median                                        mean
pinvar          <real-value>|estimate|previous                     0
siteRates       partition[:<charpartition-name>]|
                rateset[:<rateset-name>]|previous                  (none)
mpartition      <modelpartition-name>                              (none)
modelRates      estimate|previous|equal                            (none)
initBrLen       rogers|acctranRog|LS|<real-value>                  Rogers
scoreDigits     <integer-value>|auto                               auto
lCollapse       no|yes                                             yes
maxPass         <integer-value>                                    20
spToler         <real-value>                                       1e-07
dpToler         <real-value>                                       1e-10
approxLim       <real-value>|none                                  5
adjustAppLim    no|yes                                             yes
logIter         no|yes                                             no
zeroLenTest     no|full|crude                                      no
recon           marginal|joint                                     marginal
allProbs        no|yes                                             no
clock           no|yes                                             no
userBrLens      no|yes                                             no
startVals       parsApprox|arbitrary                               parsApprox
paramClock      Thorne|relAge|Rambaut                              Thorne
mlDistforLS     no|yes                                             no
showQMatrix     no|yes                                             no
fastStep        no|yes                                             yes
optimizer       Praxis|LBFGS                                       Praxis
blopt           newton1D|brent1D|multiDim                          newton1D
clRescale       <real-value>                                       1e-20
gRateScale      <real-value>|estimate|previous                     1
condVar         no|yes|auto                                        auto
precision       double|single                                      single
vectorize       no|yes                                             yes
nthreads        <integer-value>|auto                               1

Options for amino-acid models:

Keyword ------- Option type -------------------------------------- Current setting -----------------
aaFreq          empirical|equal|estimate|previous|(<list>)|
                Intrinsic                                          empirical
aaRMatrix       (<rAC>...<rYV>)|estimate|previous|oneST|JTT|
                JTTPAML|PAM|MTrev24|WAG|WAGstar|LG                 JTT

Options for generic k-state models ("standard" data):

Keyword ------- Option type -------------------------------------- Current setting -----------------
mkStateSpace    variable|fixed                                     variable
genFreq         empirical|equal|estimate|previous|(<list>)         empirical
genRmatrix      (<r01><r02>...)|estimate|previous|oneST            OneST
genRclass       (<c01><c02>...)                                    '(aaaaaa)'

The following options pertain only to Beagle-enabled versions::

Keyword ------- Option type -------------------------------------- Current setting -----------------
useBeagle       no|GPU|CPU|<resource-number>                       no
invarSiteMem    compact|fullStore                                  compact

paup> lset nst=1 basefreq=estimate rates=gamma tratio=estimate

paup> hsearch ?

Usage: HSearch [options...];

Available options:

Keyword ------- Option type -------------------------------------- Current setting -----------------
swap            none|NNI|SPR|TBR                                   TBR
keep            <real-value>|No                                    No
mulTrees        no|yes                                             yes
writeCurTree    no|yes                                             no
enforce         no|yes                                             no
constraints     <constraint-name>                                  (none)
converse        no|yes                                             no
reconLimit      <integer-value>|infinity                           8
nchuck          <integer-value>                                    0
chuckScore      <real-value>|No                                    No
start           stepwise|NJ|current|<tree-number>[-<tree-number>] *Stepwise
addSeq          simple|closest|asIs|random|furthest                simple
nreps           <integer-value>                                    10
rseed           <int> or <int:int:int:int>                         0
rstatus         no|yes                                             no
saveReps        no|yes                                             no
refTax          <integer-value>                                    0
hold            <integer-value>|No                                 1
nbest           <integer-value>|all                                all
allSwap         no|yes                                             no
useNonMin       no|yes                                             no
steepest        no|yes                                             no
abortRep        no|yes                                             no
retain          no|yes                                            *no
statusWin       no|yes                                             yes
dStatus         <integer-value>|none                               60
randomize       addSeq|trees                                       addSeq
timeLimit       <integer-value>|none                               none
rearrLimit      <integer-value>|none                               none
limitPerRep     no|yes                                             no
                                                                  *Option is nonpersistent

paup> hsearch swap=NNI nreps=100

Heuristic search settings:
  Optimality criterion = parsimony
    Character-status summary:
      Of 1281 total characters:
        All characters are of type 'unord'
        All characters have equal weight
        1104 characters are constant (proportion = 0.861827)
        145 variable characters are parsimony-uninformative
        Number of parsimony-informative characters = 32
    Gaps are treated as "missing"
    Multistate taxa interpreted as uncertainty
  Starting tree(s) obtained via stepwise addition
    Addition sequence: simple (reference taxon = Canis lupus)
    Number of trees held at each step = 1
  Branch-swapping algorithm: nearest-neighbor interchange (NNI)
    Steepest descent option not in effect
  Initial 'Maxtrees' setting = 100
  Branches collapsed (creating polytomies) if maximum branch length is zero
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

Heuristic search completed
  Total number of rearrangements tried = 20
  Score of best tree(s) found = 199
  Number of trees retained = 1
  Time used = 0.00 sec (CPU time = 0.00 sec)

paup> describetrees 1

Tree description:

  Unrooted tree(s) rooted using outgroup method

  Note: No outgroup has been defined; tree is (arbitrarily) rooted at first taxon.
  Optimality criterion = parsimony
    Character-status summary:
      Of 1281 total characters:
        All characters are of type 'unord'
        All characters have equal weight
        1104 characters are constant (proportion = 0.861827)
        145 variable characters are parsimony-uninformative
        Number of parsimony-informative characters = 32
    Gaps are treated as "missing"
    Multistate taxa interpreted as uncertainty
    Character-state optimization: Accelerated transformation (ACCTRAN)

Tree 1 (rooted using default outgroup)

Tree length = 199
Consistency index (CI) = 0.9497
Homoplasy index (HI) = 0.0503
CI excluding uninformative characters = 0.7727
HI excluding uninformative characters = 0.2273
Retention index (RI) = 0.7619
Rescaled consistency index (RC) = 0.7236

/------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- Canis lupus
|
|                            /-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- Phoca largha
|                            |
\---------------------------16                             /-------------------------------------------------------------------------------------------------------------------------------------------------- Ailuropoda melanoleuca
                             |                             |
                             \----------------------------15                            /--------------------------------------------------------------------------------------------------------------------- Tremarctos ornatus
                                                           |                            |
                                                           |                            |                            /---------------------------------------------------------------------------------------- Helarctos malayanus
                                                           \---------------------------14                            |
                                                                                        |                            |                            /----------------------------------------------------------- Melursus ursinus
                                                                                        \---------------------------13                            |
                                                                                                                     |                            +----------------------------------------------------------- Ursus americanus
                                                                                                                     |                            |
                                                                                                                     \---------------------------12                             /----------------------------- Ursus arctos
                                                                                                                                                  +----------------------------11
                                                                                                                                                  |                             \----------------------------- Ursus maritimus
                                                                                                                                                  |
                                                                                                                                                  \----------------------------------------------------------- Ursus thibetanus

paup> savetrees 1

Error(#143): Keyword "1" is not recognized.
                 If the keyword is valid for the current command and it is spelled correctly, look for problems in a previous command, such as a missing semicolon.

paup> savetrees

1 tree saved to file "~/repos/macrophy_course/projects/PAUP_lab/bears_irbp.tre"

paup> savetrees paup_bear2.tre

Error(#143): Keyword "paup bear2.tre" is not recognized.
                 If the keyword is valid for the current command and it is spelled correctly, look for problems in a previous command, such as a missing semicolon.

paup> lset variant=HKY

paup> hsearch swap=NNI nreps=100

Heuristic search settings:
  Optimality criterion = parsimony
    Character-status summary:
      Of 1281 total characters:
        All characters are of type 'unord'
        All characters have equal weight
        1104 characters are constant (proportion = 0.861827)
        145 variable characters are parsimony-uninformative
        Number of parsimony-informative characters = 32
    Gaps are treated as "missing"
    Multistate taxa interpreted as uncertainty
  Starting tree(s) obtained via stepwise addition
    Addition sequence: simple (reference taxon = Canis lupus)
    Number of trees held at each step = 1
  Branch-swapping algorithm: nearest-neighbor interchange (NNI)
    Steepest descent option not in effect
  Initial 'Maxtrees' setting = 100
  Branches collapsed (creating polytomies) if maximum branch length is zero
  'MulTrees' option in effect
  No topological constraints in effect
  Trees are unrooted

Heuristic search completed
  Total number of rearrangements tried = 20
  Score of best tree(s) found = 199
  Number of trees retained = 1
  Time used = 0.00 sec (CPU time = 0.00 sec)

paup> describetrees 1

Tree description:

  Unrooted tree(s) rooted using outgroup method

  Note: No outgroup has been defined; tree is (arbitrarily) rooted at first taxon.
  Optimality criterion = parsimony
    Character-status summary:
      Of 1281 total characters:
        All characters are of type 'unord'
        All characters have equal weight
        1104 characters are constant (proportion = 0.861827)
        145 variable characters are parsimony-uninformative
        Number of parsimony-informative characters = 32
    Gaps are treated as "missing"
    Multistate taxa interpreted as uncertainty
    Character-state optimization: Accelerated transformation (ACCTRAN)

Tree 1 (rooted using default outgroup)

Tree length = 199
Consistency index (CI) = 0.9497
Homoplasy index (HI) = 0.0503
CI excluding uninformative characters = 0.7727
HI excluding uninformative characters = 0.2273
Retention index (RI) = 0.7619
Rescaled consistency index (RC) = 0.7236

/------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- Canis lupus
|
|                            /-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- Phoca largha
|                            |
\---------------------------16                             /-------------------------------------------------------------------------------------------------------------------------------------------------- Ailuropoda melanoleuca
                             |                             |
                             \----------------------------15                            /--------------------------------------------------------------------------------------------------------------------- Tremarctos ornatus
                                                           |                            |
                                                           |                            |                            /---------------------------------------------------------------------------------------- Helarctos malayanus
                                                           \---------------------------14                            |
                                                                                        |                            |                            /----------------------------------------------------------- Melursus ursinus
                                                                                        \---------------------------13                            |
                                                                                                                     |                            +----------------------------------------------------------- Ursus americanus
                                                                                                                     |                            |
                                                                                                                     \---------------------------12                             /----------------------------- Ursus arctos
                                                                                                                                                  +----------------------------11
                                                                                                                                                  |                             \----------------------------- Ursus maritimus
                                                                                                                                                  |
                                                                                                                                                  \----------------------------------------------------------- Ursus thibetanus

paup> savetrees

OK to replace file "bears_irbp.tre"? (Y/n)n

paup> savetrees file=./khanhto/paul_bear2.tre format=newick root=yes brlens=yes supportvalues=nodelabels trees=all

1 tree saved to file "~/repos/macrophy_course/projects/PAUP_lab/khanhto/paul_bear2.tre" in raw Newick format
